In [1]:
import pandas as pd

In [19]:
df1 = pd.read_excel('id_age.xlsx')

In [20]:
df1

   ID  Age
0   1   25
1   2   30
2   3   35

In [21]:
df2 = pd.read_excel('id_name.xlsx')

In [22]:
df2

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [23]:
merge_ = pd.merge(df1, df2, on="ID", how="inner")

In [24]:
merge_

   ID  Age     Name
0   1   25    Alice
1   2   30      Bob
2   3   35  Charlie

In [25]:
merge_left = pd.merge(df1, df2, on="ID", how="left")

In [26]:
merge_left

   ID  Age     Name
0   1   25    Alice
1   2   30      Bob
2   3   35  Charlie

In [27]:
merge_right = pd.merge(df1, df2, on="ID", how="right")

In [28]:
merge_right

   ID  Age     Name
0   1   25    Alice
1   2   30      Bob
2   3   35  Charlie